{"class_name": "Sequential", "keras_version": "2.1.5", "backend": "tensorflow", "config": [{"class_name": "Masking", "config": {"dtype": "float32", "trainable": true, "batch_input_shape": [null, 3, 11], "name": "masking_1", "mask_value": -1}}, {"class_name": "LSTM", "config": {"bias_regularizer": null, "trainable": true, "implementation": 1, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "units": 32, "dropout": 0.2, "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "recurrent_dropout": 0.0, "use_bias": true, "name": "lstm_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "tanh", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "dtype": "float32", "recurrent_regularizer": null, "stateful": false, "batch_input_shape": [null, 3, 11], "unroll": false, "kernel_constraint": null, "return_state": false, "bias_constraint": null, "kernel_regularizer": null, "go_backwards": false, "unit_forget_bias": true, "return_sequences": false}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "dtype": "float32", "trainable": true, "kernel_regularizer": null, "name": "dense_1", "batch_input_shape": [null, 32], "units": 5, "kernel_constraint": null, "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "softmax"}}]}