{"config": [{"config": {"mask_value": -1, "name": "masking_1", "batch_input_shape": [null, 2, 18], "dtype": "float32", "trainable": true}, "class_name": "Masking"}, {"config": {"return_state": false, "recurrent_activation": "hard_sigmoid", "batch_input_shape": [null, 2, 18], "dtype": "float32", "return_sequences": false, "units": 32, "stateful": false, "recurrent_regularizer": null, "recurrent_constraint": null, "dropout": 0.2, "implementation": 1, "unit_forget_bias": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "trainable": true, "kernel_constraint": null, "go_backwards": false, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "name": "lstm_1", "unroll": false, "recurrent_dropout": 0.0, "bias_regularizer": null, "kernel_regularizer": null, "activation": "tanh", "activity_regularizer": null}, "class_name": "LSTM"}, {"config": {"bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "batch_input_shape": [null, 32], "dtype": "float32", "use_bias": true, "units": 7, "name": "dense_1", "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "activation": "linear", "activity_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"name": "activation_1", "activation": "softmax", "trainable": true}, "class_name": "Activation"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.1.5"}