{"backend": "tensorflow", "keras_version": "2.1.5", "class_name": "Sequential", "config": [{"class_name": "Masking", "config": {"trainable": true, "dtype": "float32", "batch_input_shape": [null, 2, 12], "mask_value": -1, "name": "masking_1"}}, {"class_name": "LSTM", "config": {"bias_constraint": null, "implementation": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activation": "tanh", "recurrent_constraint": null, "name": "lstm_1", "units": 32, "activity_regularizer": null, "go_backwards": false, "unit_forget_bias": true, "bias_regularizer": null, "batch_input_shape": [null, 2, 12], "dropout": 0.2, "use_bias": true, "return_sequences": false, "kernel_constraint": null, "trainable": true, "dtype": "float32", "stateful": false, "recurrent_dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "return_state": false, "kernel_regularizer": null, "unroll": false, "recurrent_activation": "hard_sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_regularizer": null}}, {"class_name": "Dense", "config": {"units": 6, "trainable": true, "dtype": "float32", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activation": "linear", "name": "dense_1", "kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "batch_input_shape": [null, 32], "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "softmax", "name": "activation_1"}}]}