{"backend": "tensorflow", "keras_version": "2.1.5", "config": [{"config": {"mask_value": -1, "trainable": true, "batch_input_shape": [null, 2, 11], "name": "masking_1", "dtype": "float32"}, "class_name": "Masking"}, {"config": {"dtype": "float32", "unroll": false, "name": "lstm_1", "batch_input_shape": [null, 2, 11], "unit_forget_bias": true, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "bias_constraint": null, "return_state": false, "recurrent_constraint": null, "activity_regularizer": null, "recurrent_dropout": 0.0, "dropout": 0.2, "recurrent_regularizer": null, "activation": "tanh", "kernel_constraint": null, "implementation": 1, "trainable": true, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "return_sequences": false, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "use_bias": true, "stateful": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 32, "kernel_regularizer": null}, "class_name": "LSTM"}, {"config": {"dtype": "float32", "activation": "linear", "kernel_constraint": null, "name": "dense_1", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "batch_input_shape": [null, 32], "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "units": 5, "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "softmax", "name": "activation_1"}, "class_name": "Activation"}], "class_name": "Sequential"}