{"keras_version": "2.1.5", "class_name": "Sequential", "config": [{"class_name": "Masking", "config": {"trainable": true, "batch_input_shape": [null, 3, 11], "mask_value": -1, "name": "masking_1", "dtype": "float32"}}, {"class_name": "LSTM", "config": {"batch_input_shape": [null, 3, 11], "implementation": 1, "bias_constraint": null, "trainable": true, "go_backwards": false, "stateful": false, "use_bias": true, "bias_regularizer": null, "recurrent_dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "return_state": false, "name": "lstm_1", "activity_regularizer": null, "activation": "tanh", "recurrent_regularizer": null, "dtype": "float32", "return_sequences": false, "recurrent_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "units": 32, "recurrent_activation": "hard_sigmoid", "unroll": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "dropout": 0.2}}, {"class_name": "Dense", "config": {"batch_input_shape": [null, 32], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "dtype": "float32", "use_bias": true, "bias_regularizer": null, "units": 5, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activation": "linear", "name": "dense_1", "bias_constraint": null, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "softmax", "name": "activation_1"}}], "backend": "tensorflow"}