{"class_name": "Sequential", "config": [{"class_name": "Masking", "config": {"trainable": true, "name": "masking_1", "batch_input_shape": [null, 2, 17], "dtype": "float32", "mask_value": -1}}, {"class_name": "LSTM", "config": {"stateful": false, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "return_sequences": false, "unit_forget_bias": true, "kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": null, "units": 32, "dtype": "float32", "bias_regularizer": null, "trainable": true, "batch_input_shape": [null, 2, 17], "activity_regularizer": null, "go_backwards": false, "recurrent_dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "tanh", "return_state": false, "recurrent_regularizer": null, "implementation": 1, "use_bias": true, "recurrent_constraint": null, "name": "lstm_1", "unroll": false, "dropout": 0.2}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "batch_input_shape": [null, 32], "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 7, "activation": "linear", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_constraint": null, "kernel_regularizer": null, "dtype": "float32", "use_bias": true, "bias_regularizer": null, "name": "dense_1", "activity_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_1"}}], "backend": "tensorflow", "keras_version": "2.1.5"}