{"config": [{"config": {"mask_value": -1, "dtype": "float32", "name": "masking_1", "trainable": true, "batch_input_shape": [null, 2, 13]}, "class_name": "Masking"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "implementation": 1, "name": "lstm_1", "recurrent_dropout": 0.0, "bias_regularizer": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "dropout": 0.2, "use_bias": true, "unroll": false, "unit_forget_bias": true, "stateful": false, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "dtype": "float32", "units": 32, "activity_regularizer": null, "bias_constraint": null, "return_state": false, "trainable": true, "kernel_constraint": null, "recurrent_regularizer": null, "activation": "tanh", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "return_sequences": false, "batch_input_shape": [null, 2, 13]}, "class_name": "LSTM"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "dtype": "float32", "units": 6, "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "trainable": true, "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "name": "dense_1", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "batch_input_shape": [null, 32]}, "class_name": "Dense"}, {"config": {"name": "activation_1", "trainable": true, "activation": "softmax"}, "class_name": "Activation"}], "keras_version": "2.1.5", "backend": "tensorflow", "class_name": "Sequential"}