{"config": [{"config": {"trainable": true, "dtype": "float32", "batch_input_shape": [null, 2, 20], "mask_value": -1, "name": "masking_1"}, "class_name": "Masking"}, {"config": {"batch_input_shape": [null, 2, 20], "stateful": false, "implementation": 1, "return_sequences": false, "dropout": 0.2, "kernel_regularizer": null, "use_bias": true, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "units": 32, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "activity_regularizer": null, "unroll": false, "dtype": "float32", "activation": "tanh", "recurrent_constraint": null, "trainable": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "recurrent_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "name": "lstm_1", "unit_forget_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_dropout": 0.0, "go_backwards": false, "return_state": false}, "class_name": "LSTM"}, {"config": {"batch_input_shape": [null, 32], "dtype": "float32", "activation": "linear", "name": "dense_1", "trainable": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "units": 8, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "softmax", "name": "activation_1"}, "class_name": "Activation"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.1.5"}