{"keras_version": "2.1.5", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Masking", "config": {"name": "masking_1", "dtype": "float32", "mask_value": -1, "batch_input_shape": [null, 2, 13], "trainable": true}}, {"class_name": "LSTM", "config": {"dtype": "float32", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_dropout": 0.0, "trainable": true, "activity_regularizer": null, "unit_forget_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "lstm_1", "activation": "tanh", "recurrent_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "bias_regularizer": null, "implementation": 1, "recurrent_activation": "hard_sigmoid", "batch_input_shape": [null, 2, 13], "kernel_regularizer": null, "stateful": false, "dropout": 0.2, "go_backwards": false, "return_state": false, "use_bias": true, "kernel_constraint": null, "units": 32, "recurrent_constraint": null, "unroll": false, "return_sequences": false, "bias_constraint": null}}, {"class_name": "Dense", "config": {"dtype": "float32", "bias_regularizer": null, "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "name": "dense_1", "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "use_bias": true, "units": 6, "bias_constraint": null, "batch_input_shape": [null, 32], "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "config": {"activation": "softmax", "name": "activation_1", "trainable": true}}]}