{"class_name": "Sequential", "keras_version": "2.1.5", "config": [{"class_name": "Masking", "config": {"trainable": true, "name": "masking_1", "dtype": "float32", "batch_input_shape": [null, 2, 17], "mask_value": -1}}, {"class_name": "LSTM", "config": {"trainable": true, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "name": "lstm_1", "batch_input_shape": [null, 2, 17], "return_sequences": false, "return_state": false, "kernel_regularizer": null, "units": 32, "recurrent_dropout": 0.0, "bias_constraint": null, "dropout": 0.2, "kernel_constraint": null, "implementation": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_regularizer": null, "use_bias": true, "unit_forget_bias": true, "activation": "tanh", "unroll": false, "activity_regularizer": null, "dtype": "float32", "recurrent_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "stateful": false}}, {"class_name": "Dense", "config": {"trainable": true, "name": "dense_1", "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "batch_input_shape": [null, 32], "activity_regularizer": null, "dtype": "float32", "bias_regularizer": null, "activation": "linear", "units": 7, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "softmax"}}], "backend": "tensorflow"}